[
  {
    "img": "assets/img/icmdrse-kspk-9.jpg",
    "title": "Prof. Dr. Chinmoy Sahu",
    "desc": "Vice Chancellor",
    "desc1": "Manipal GlobalNxt University, <br/> Malaysia.",
    "bio": "Prof. Dr. Chinmoy Sahu is an accomplished educator. He has been instrumental in creating globally disruptive learning opportunities in the higher education industry over the past two and half decades. Widely recognized for his contributions, he has also been featured in the global list of ‘uLektz Wall of Fame’ as “Top 50 Thought Leaders in Higher Education”. He holds a PhD in Business Administration and has been certified by Harvard Business Publishing for “Teaching with Cases Online”. His areas of research are in learning technology and corporate finance. Dr Sahu&#39;s work has been widely published in international scholarly journals. He is the Vice Chancellor of Manipal GlobalNxt University and is based in Kuala Lumpur, Malaysia.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/icmdrse-spk8.jpg",
    "title": "Assoc Prof Ts. Dr. Goh Wei Wei",
    "desc": "Head of Department",
    "desc1": "School of Computer Science,Taylor’s University, <br/>Malaysia.",
    "bio": "Associate Professor Ts Dr Goh Wei Wei is currently the Digital Health and Innovations Impact Lab Deputy Director and Programme Director of Bachelor of Information Technology, senior lecturer at the School of Computer Science at Taylor’s University. She received her Ph.D. major in E-learning from the University of Derby, UK. She has been in the academic for the past 20 years. Dr Goh Wei Wei has been working on learning, teaching and assessment design strategies, online learning technologies, social media technologies, knowledge management, Machine Learning and Internet of Things research. She emphasised her familiarity with online technologies due to her experience of using them in teaching as she likes to develop technology-rich classrooms. She has been working on various multi-disciplinary projects with the Design School too. Dr Goh Wei Wei has recently won 2 gold medal awards, and 1 bronze medal award in International University Carnival on E-learning (IUCEL) 2022, 1 bronze medal award in Econdev 2022 for her experience in developing technology- rich classrooms initiatives. She introduced Engage VR platform to create an immersive presence in the virtual learning environment to her students. She also let her students have the hands-on experience of using the Oculus Quest 2 and HoloLens to experience Augmented Reality and Virtual Reality. Dr Goh Wei Wei also won a total of 4 silver medals award in Malaysia Technology Expo (MTE) in year  2021 and 2022 for her innovative Internet of Things prototype development related to digital health and innovations. She also won silver medal for Smart Medication Management and Medicine Delivery System in 32nd International Invention, Innovation and Technology Exhibition in 2021. Dr Goh Wei Wei has the practical skills, the hands-on experience and the educational credentials to make a significant difference to the university",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/icmdrse-spk7.jpg",
    "title": "Assoc. Prof. Dr. Ummi Naiemah Saraih",
    "desc": "Faculty of Business & Communication",
    "desc1": "Head of Department, Department of Business, Faculty of Business & Communication,Universiti Malaysia Perlis (UniMAP) <br/>Malaysia.",
    "bio": "Assoc. Prof. Dr. Ummi Naiemah Saraih serves as a Head of Business Department at the Faculty of Business &amp; Communication, Universiti Malaysia Perlis (UniMAP), Malaysia. She began her career as an Administrative Officer (N41) at KUKUM/UniMAP in 2002 before being appointed as a Senior Lecturer (DS41) at the Centre for Innovation and Technopreneurship Studies (PPIPT), UniMAP, effective January 1, 2015. She has also been serving as the Head of the Centre of Excellence for Social Innovation and Sustainability (CoESIS) since August 2022 until September 2024. She obtained her Bachelor’s Degree in Human Resource Management in 2000, a Master of Science in Management in 2007, and a Ph.D. in Management in 2014 from Universiti Utara Malaysia (UUM), Malaysia. Additionally, she is a Visiting Professor at Daffodil International University (DIU), Bangladesh, and a member of the Board of Studies and the Faculty Board at Shaheed Zulfikar Ali Bhutto Institute of Science and Technology (SZABIST), Pakistan. Since January 2022, she has also been appointed as the Editor-in-Chief of the International Journal of Business and Technopreneurship (IJBT), a MyCite-indexed journal at UniMAP. Internationally, she serves on the Advisory Boards of two prominent journals in Pakistan: The Academy of Education and Social Sciences Review (AESSR) and the International Journal of Business, Analytics and Technology. In terms of research, her focus is on Organizational Behavior and Human Resource Management. She has contributed to over 200 journal articles and conference proceedings in various WOS/SCOPUS and MyCite indexed journals and proceedings. She has also authored more than 30 books and book chapters. To date, she has produced over 20 copyrighted works in her research field. With nearly a decade of academic experience, she has supervised almost 50 postgraduate students (in full research mode andcoursework).",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/icmdrse-ks-1.jpg",
    "title": "Prof.Ts.Ir. Dr Mardeni Bin Roslee",
    "desc": "Chief Executive Officer, Armada Smart Tech MR Sdn Bhd",
    "desc1": "Chairman, Centre of Wireless Technology, Centre of Excellence,Multimedia University <br/>Malaysia.",
    "bio": "Prof. Mardeni is a Chief Executive Officer (CEO) and main founder of Armada Smart Tech MR Sdn Bhd and Chairman of Centre of Wireless Technology, Centre of Excellence, Multimedia University, Malaysia. His current research interests are 5G/6G telecommunication, Artificial Intelligence, Internet of Things and radar communication. In professional association, he was a Chairman of Institute of Electrical and Electronics (IEEE) Communication Society/Vehicular Technology Society. He is a registered Chartered Engineer with Engineering Council United Kingdom, and Member with The Institution of Engineering and Technology (IET), UK and a Senior Member IEEE (SMIEEE). He appointed as a Visiting Professor at 10 abroad Universities and at national and international level and has been involved in industry Consultation with some companies locally and internationally. He was invited as Keynote Speaker for 30 International conferences at 16 countries such as at Thailand, China, Australia, Korea, Indonesia, Singapore, Japan, French, United Kingdom, Spain, Canada, New Zealand, Romania, India and Turkey for 2009-2024. At international conferences, he hold position as General Chair of 11 conferences globally. His contributions to academic and the engineering professional over the years have earned him recognitions nationally and internationally, He is the recipient of more than 100 research awards locally and internationally including Top Research Scientist in Malaysia in 2020 from Academy of Science Malaysia.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/icmdrse-spk-3.jpg",
    "title": "Prof. Dr. Nitin Dhote",
    "desc": "Professor and Head",
    "desc1": "Electrical Engineering Department,St. Vincent Pallotti College of Engineering & Technology <br/> Nagpur, India.",
    "bio": "Dr. Nitin Dhote did graduation in Electrical Engineering from VRCE (Now VNIT), Nagpur. He did post-graduation in Electrical Power System from Govt. College of Engg., Amravati, a Diploma in Business Management, and a Ph.D. in Electrical Engineering from RTM, Nagpur University. He is working as Professor & Head in the Electrical Engineering Department at St. Vincent Pallotti College of Engineering & Technology, Nagpur since July 2007. He worked as Assistant Professor in G H Raisoni College of Engineering & Management, Nagpur from 1998 to 2007. He is a member of the Board of Studies and a member of the Faculty of Science & Technology, RTM, Nagpur University. He has a total teaching experience of 27 years at UG and PG levels. His areas of interest are Renewable Energy Sources, Power System Protection, Automation, and Control. He published 48 research papers in reputed international conferences and journals. He is an approved PhD Supervisor at RTM, Nagpur University, and is guiding 5 PhD Scholars. He visited Portugal, Germany & Thailand for research paper presentations in international conferences and academic visits. He has chaired various sessions at national/international conferences. He delivered a keynote session in the International Conference ICDRISM-23 at Dubai, UAE. He is the recipient of a grant of Rs. 52 Lacs for research and training from different government funding agencies. His 2 patents are granted by the patent office, Government of India, and 1 is published in the National Journal of Patents. He has been granted 3 copyrights by the Government of India. He is a reviewer of IEEE, IET, Taylor & Francis, KIEE & other reputed international journals. He is a member of professional bodies ISTE & IEEE.",
    "type": "Session Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/india.png"
  },
  {
    "img": "assets/img/icmdrse-2.png",
    "title": "Dr. Diana Teresa Parra-Sanchez",
    "desc": "Scientific Director",
    "desc1": "Centro de Innovación y Productividad InnovaCTIon <br/> Colombia.",
    "bio": "Diana Teresa Parra-Sanchez is a researcher in Information Technology with a Ph.D. in Engineering.She specializes in the adoption of digital technologies, digital transformation in small and medium-sized enterprises (SMEs), and innovation policies. She is currently the Scientific Director of InnovaCTIon and is undertaking a postdoctoral fellowship at the Universidad Autónoma de Bucaramanga, Colombia, where she explores the impact of artificial intelligence and augmented reality on nature-based tourism.With extensive experience in the formulation and management of science, technology, and innovation projects, she has led initiatives aimed at fostering digital adoption and technological innovation. She is also an editor and reviewer for high-impact scientific journals, with her research published in international journals covering digitalization, IoT adoption, and knowledge management.",
    "type": "Session Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/colombia.png"
  },

  {
    "img": "assets/img/icmdrse-ks-4.jpg",
    "title": "Dr. Anu Sayal",
    "desc": "Faculty of Business and Law",
    "desc1": "School of Accounting and Finance,Taylor’s University, <br/> Malaysia.",
    "bio": "Dr. Anu Sayal is currently working as Senior Lecturer in Mathematics/ Statistics with Taylor’s Business School, Taylor’s University, Malaysia (ranked among top 50 in Asia and 251 globally). She is a accredited trainer by HRD corp. Malaysia. She has 17+ years of teaching and research experience. She has done Bachelors in Non-medical from Guru Nanak Dev University, Amritsar. Her Post Graduation was in Mathematics from Guru Nanak Dev University, Amritsar. She has done her PhD in Mathematics from Uttarakhand Technical University Dehradun. She received the “Young Scientist Award in Mathematics: Statistics and Computer Science from Uttarakhand Council for Science and Technology, Dehradun, Uttarakhand, in February 2020 at UCOST, Dehradun. She has also received Teacher of the Year 2020 Award in September 2020 from Divya Himgiri in association with Uttarakhand Council for Science & Technology, Government of Uttarakhand, Commission for Scientific & Technical Terminology, MHRD, Govt. of India, New Delhi. She received Guruwarya samman 2021 award from Harvest educational transformational solutions (HETS). She also received Best woman scientist award from Novel research academy in December 2021. She was also awarded as the Best teacher in January 2022 by Harvest educational transformational solutions.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/icmdrse-ks-5.jpg",
    "title": "Prof. Ts. Dr. Norazah Mohd Suki",
    "desc": "Professor of Marketing & E-Commerce",
    "desc1": "Deputy Dean of Research, Innovation & Corporate Relations,Othman Yeop Abdullah Graduate School of Business (OYAGSB),<br/>Malaysia.",
    "bio": "Professor Ts. Dr Norazah Mohd Suki is a professor of marketing and e-commerce at the Othman Yeop Abdullah Graduate School of Business (OYAGSB), Universiti Utara Malaysia. Prof Norazah, who has been named to Stanford University's World's Top 2% Scientists list since 2019, was also named to the ‘Career-long World’s Top 2% Scientists’ list. She is also a recipient of Malaysia’s Research Star Award 2018, Highly Commended Paper in Emerald Literati Network Awards for Excellence in 2015 and 2017, winner of IGI Global Seventh Annual Awards Excellence in Research Journal, etc. Her research interests include marketing research, consumer behaviour, m-commerce, e-commerce, e- marketing, green marketing, Islamic marketing, and marketing-related fields. Prof Norazah has published more than 400 articles in journals, book chapters, books, and conference papers describing her research activities. She is also the editor of several books indexed on SCOPUS. She has extensive experience as an invited speaker in courses on Structural Equation Modelling (SEM), Statistical Package for Social Sciences (SPSS) and research methodology. Through her active participation in the co-curricular activities of Pasukan Siswa Angkatan Pertahanan Awam Malaysia, she was awarded Pingat Am Pertahanan Awam in 2017 and Pingat Bakti Pertahanan Awam in 2021.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/icmdrse-kspk-6.jpg",
    "title": "Dr. Jyothi AP",
    "desc": "Faculty of Engineering and Technology",
    "desc1": "Department of CSE,M.S Ramaiah University Of Applied Sciences, <br/> India.",
    "bio": "Dr. Jyothi A P completed her PhD in 2020, master’s degree in 2009, Bbachelor&#39;s degree in 2002 from Visvesvaraya Technological University, India. She is currently working as a faculty in the Department of Computer Science and Engineering, Faculty of Engineering and Technology, M S Ramaiah University of Applied Sciences, Ramaiah Technology Campus, Bengaluru. She has nearly 18 years of experience in teaching and has published many research papers in journals indexed in SCI/SCIE, WOS, SCOPUS etc. and presented papers in several National and International conferences. Her research interest is in the field of Wireless sensor network, MANET, IOT, AI, ML and Deep Learning. She is a member of LMISTE, LMIAENG, AMIETE, IFERP, LMINSC and IEEE. She is a reviewer for SPRINGER, WILEY, IEEE, Elsevier, IGI, Oriental Journals and conferences, she is also reviewer of international conference papers from Taiwan, Prague, Czech Republic and Japan. She has authored book chapter in Springer, Wiley, IET , CRC Press Talyor and Francis group etc. She is serving as editor for reputed journals and book publications. She has served as a a resource person in India and abroad. She has received the best Women researcher award and several research excellence awards. She has Indian, Australian, German and UK Patents granted in her name.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/india.png"
  },
  {
    "img": "assets/img/icmdrse-kspk-7.jpg",
    "title": "Assoc Prof. Dr. Hoshang Kolivand",
    "desc": "Liverpool John Moores University",
    "desc1": "United Kingdom.",
    "bio": "Hoshang Kolivand is an accomplished researcher in the field of computer science, specializing in AI and Mixed Reality. He received his MS degree in applied mathematics and computer from Amirkabir University of Technology, Iran, in 1999. He went on to pursue his PhD at the Media and Games Innovation Centre of Excellence (MaGIC-X) in Universiti Teknologi Malaysia, completing it in 2013. Dr. Kolivand further honed his expertise in Augmented Reality through a Post Doctoral program at UTM in 2014. With a rich academic background, Hoshang has previously served as a lecturer atShahid Beheshti University, Iran, and later as a Senior Lecturer at Universiti Teknologi Malaysia. Currently, he holds the position of Reader(Associate Professor) in AI and Mixed Reality at Liverpool John Moores University and is also a Visiting Professor at Bharath Institute of Higher Education and Research: BIHER, Chennai, India. Throughout his career, Hoshang has made significant contributions to the academic community. He has authored numerous articles in international journals, conference proceedings, and technical papers, including book chapters. Additionally, he has published several books on object-oriented programming and mathematics. Dr. Kolivand is recognized as a Senior member of IEEE and actively contributes to various conferences and international journals as a Technical Program Committee (TCP) member. His dedication to advancing the field of computer science and his passion for research continue to drive his pursuit of knowledge and innovation.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/uk.png"
  },
  {
    "img": "assets/img/icmdrse-kspk-8.png",
    "title": "Assoc. Prof. Ts. Ir. Dr. Mohammad Lutfi Bin Othman, PEPC ACPE PTech CEng REEM CPMV",
    "desc": "Universiti Putra  Malaysia",
    "desc1": "Selangor, Malaysia.",
    "bio": "Ts. Ir. Dr. Mohammad Lutfi Othman received the BSc degree with honor distinction (Magna Cum Laude) in electrical eng. from the University of Arizona, Tucson, Arizona, USA, in 1990, the MSc &amp; PhD degrees in electrical power eng. from the Universiti Putra M&#39;sia in 2004 &amp; 2011 respectively. He is an Associate Professor at the Dept. of Electrical &amp; Electronics Eng., Fac. of Eng., UPM. He is a Researcher &amp; the founding member of the Centre for Advanced Power &amp; Energy Research (CAPER), UPM, now consolidated as Advanced Lightning, Power and Energy Research (ALPER). He is also an Electrical Director in a local engineering consulting firm with over 29 years of professional experience in planning, design and project administration of over 250 electrical projects. Ir. Dr. Lutfi’s areas of research interest include numerical protective relay modeling/simulation/operation analysis using computational-intelligent-based data mining and expert system approaches as well as energy efficiency studies. He is a Principal Author of numerous manuscripts of high impact factor journals, a Technical Editor and Reviewer of various journal and conference manuscripts, a Technical Evaluator of research grant and a Keynote Speaker of international conferences. He is a Professional Engineer (PEng) under the Board of Engineers M&#39;sia (BEM), an Asean Chartered Professional Engineer (ACPE), a Professional Engineering Technologist (PTech) under the Malaysian Board of Technologist (MBOT), a Chartered Engineer (CEng) under the Engineering Council UK, a Registered Electrical Energy Manager (REEM) under Energy Commission M&#39;sia, a Certified Professional in Measurement &amp; Verification (CPMV) - Green Technology Corp M&#39;sia, a corporate member of the Institution of Engineers M&#39;sia (IEM), a senior member of IEEE (SMIEEE) USA, a member of the IEEE Power &amp; Energy Society (IEEE-PES), a member of the IEEE Computational Intelligence Society (IEEE-CIS), a member of the Institution of Engineering &amp; Technology (IET) UK, a member of the International Rough Set Society (IRSS), and a member of Phi Kappa Phi Honor Society, The University of Arizona. As a Professional Engineer, he is a Mentor and Professional Interviewer for IEM/BEM PEng aspirants.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },

  {
    "img": "assets/img/icmdrse-spk10.jpg",
    "title": "Dr. Farman Ali",
    "desc": "Postdoc Researcher, Centre of Wireless Technology, Centre of Excellence,",
    "desc1": "Multimedia University,Malaysia.",
    "bio": "Dr. Farman Ali is a Postdoc Researcher at Centre of Wireless Technology, Centre of Excellence, Multimedia University, Malaysia. His interested areas are UAV Channel Modelling, UAV to ground and UAV to ship communication and Integration of AI into optical communication and wireless Communication. Previously he was an Associate Professor at Qurtuba University of Science and IT, D.I Khan, Pakistan which focus on Digital Signal Processing, Microprocessor Microcontroller, Optical Fiber Communication, Digital and Logic Circuit Design. He has various Research projects including international grant from China National Key Research and Development Program under Grant 2018YFB0803600, in part by the Natural Science Foundation of China under and also grant from Ministry of Education and the Deanship of Scientific Research, Najran University. Kingdom of Saudi Arabia.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/icmdrse-ks-11.jpg",
    "title": "Assoc .Prof . Dr. Ratneswary Rasiah ",
    "desc": "Associate Professor of Economics ",
    "desc1": "Graduate School of Business, SEGi University and Colleges, Malaysia.",
    "bio": "Dr. Ratneswary Rasiah is an Associate Professor at the Graduate School of Business ,SEGi University Malaysia , She previously held the position of Programme Director of the Post-Graduate Business (Coursework) Programmes, Taylor’s Business School, Taylor’s University,where she has been attached for the last eighteen years. She has extensive teaching experience in the field of Economics for the past thirty-one years, having taught numerous undergraduate and post-graduate modules. In addition, she has also taught Economics for the University of London International Programme, at the British University in Hanoi, Vietnam. She received the Taylor’s Education Group Chairman’s Award for Excellence in Teaching for her immense contribution in the field of teaching and learning.Dr. Ratneswary also actively undertakes research and scholarly activities. Aside from supervising PhD students and presenting papers at international conferences, she has also published several papers in peer-reviewed journals and has secured several research grants. Her research area of interest includes financial literacy, financial well-being, retirement preparedness, subjective well-being, environmental issues and fertility. Her publications involve both primary and secondary data analysis techniques including AMOS-SEM, PLS-SEM and panel estimation techniques such as Pooled Mean Group, Mean Group, Dynamic Fixed Effect and Generalized Method of Moments. She also actively conducts trainings /workshops.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/icmdrse-ks-12.jpg",
    "title": "Datin. Dr. Norhanim binti Dewa",
    "desc": "Senior Lecturer",
    "desc1": "Graduate School of Business, SEGi University and Colleges, Malaysia.",
    "bio": "Datin Dr. Norhanim Dewa is an internationally recognized academic and industry expert with over two decades of leadership in financial education, corporate strategy, and innovation. Currently a Senior Lecturer at SEGi University’s Graduate School of Business, Malaysia, she specializes in corporate finance, capital markets and business development with a strong commitment to the applied student-centered learning. Dr. Norhanim holds a PhD in Management (Finance) and has previously served as Finance Director in both Oil & Gas and F&B sectors. Her professional journey reflects a rare integration of high-level industry acumen and deep academic scholarship. An innovator in gamified learning for financial literacy, Dr. Norhanim is the visionary behind several award-winning innovations namely; SharkFin: The VR Financial Odyssey, SmartFin Junior and SmartFin Pro. These tools blend board game mechanics, digital platforms, and immersive VR technology which earned national accolades such as Gold,Silver, and Special EduTech Innovation Awards at Malaysia’s premier innovation expos. Her work has been distinguished for revolutionizing financial education among youth and advancing SDG 4 (Quality Education). An active researcher and conference speaker, she has published widely in international journals, reviewed for Scopus-indexed proceedings, and led multiple postgraduate research projects across Asia. Passionate about impact-driven education, Dr. Norhanim continues to empower communities through financial literacy, immersive learning, and academicexcellence.",
    "type": "Keynote Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },

  {
    "img": "assets/img/ses-spk-1.jpg",
    "title": "Prof. Dr. Nalin Abeysekera",
    "desc": "Dean",
    "desc1": "Faculty of Management Studies,The Open University of Sri Lanka <br/> Sri Lanka.",
    "bio": "Professor Nalin Abeysekera is a distinguished academic and researcher, currently serving as the Dean of the Faculty of Management Studies at the Open University of Sri Lanka. With a Ph.D. in Management and a B.Sc. in Marketing, he has over two decades of experience in academia and consultancy, specializing in Strategic Management, Marketing, and Research Methodology. Professor Abeysekera has taught and conducted research internationally, including in Canada, Dubai, Singapore, Oman, India, and Qatar, and has supervised numerous Ph.D. students. In addition to his academic work, Professor Abeysekera has made significant contributions to national development through his consulting roles and policy advisory positions. He has worked with leading organizations and government bodies, shaping industry practices and national policies. His expertise has been instrumental in projects related to health financing, tourism, and economic resilience, demonstrating his commitment to driving impactful change at both the organizational and national levels. He is the Editor-in-Chief of the Sri Lanka Journal of Management Studies and a reviewer for several leading international journals. His research has resulted in numerous publications, including journal articles, conference papers, and books. Recognized for his contributions, Professor Abeysekera has received awards such as the “Outstanding Asian Educator” and the Best Reviewer Award. Passionate about knowledge dissemination and nurturing future leaders, he emphasizes the importance of ethical practices, emotional intelligence, and empathy in leadership.",
    "type": "Session Speakers",
    "flagUrl": "https://cdn.iferp.in/flag/srilanka.png"
  },

  {
    "img": "assets/img/psk-1.jpg",
    "title": "Asst. Prof. Dr. Chok Nyen Vui",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia.",
    "bio": "Prof. Dr. Chinmoy Sahu is an accomplished educator. He has been instrumental in creating globally disruptive learning opportunities in the higher education industry over the past two and half decades. Widely recognized for his contributions, he has also been featured in the global list of ‘uLektz Wall of Fame’ as “Top 50 Thought Leaders in Higher Education”. He holds a PhD in Business Administration and has been certified by Harvard BusinessPublishing for “Teaching with Cases Online”. His areas of research are in learning technology and corporate finance. Dr Sahu&#39;s work has been widely published in internationalscholarly journals. He is the Vice Chancellor of Manipal GlobalNxt University and is based in Kuala Lumpur, Malaysia.",
    "type": "Panel Discussion Speaker",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/psk-2.jpg",
    "title": "Asst. Prof. Dr. Rana Altounjy",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia.",
    "bio": "Asst. Prof. Dr. Rana Altounjy is a passionate educator, programs leader, and researcher based in Kuala Lumpur, Malaysia, making significant contributions to management, finance, and education. She holds a PhD in Management from Universiti Kuala Lumpur and an MSc in Accounting from Aleppo University, reflecting a strong international academic foundation. A member of the Malaysian Institute of Management (MIM), Dr. Altounjy is deeply engaged with industry trends and academic development. Her teaching covers Accounting, Finance, Research Methods, and Data Analysis, equipping students with essential skills for the modern business world. Her research focuses on Fintech and Edutech, exploring how technology is transforming finance and education. Through her innovative work, she contributes valuable insights to both academia and industry. Dr. Altounjy is also a dedicated mentor, guiding students toward academic and professional success. Her commitment to excellence and future-oriented vision continues to inspire learners and professionals alike.",
    "type": "Panel Discussion Speaker",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/psk-3.jpg",
    "title": "Asst. Prof. Dr. Dalwinder Kaur",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia.",
    "bio": "Dr. Dalwinder Kaur is an Assistant Professor and Programme Coordinator at the School of Education, Manipal GlobalNxt University, Kuala Lumpur, with 15 years of experience in higher education. She holds a fast-track PhD in Education from the University of Malaya and specializes in TESL, teacher education, curriculum development, and educational technology. A certified Human Resource Development Corp trainer, she has conducted trainings in curriculum design, professional development, and leadership. She has also delivered keynotes and plenaries internationally. Appointed as a United Nations Youth Peace Ambassador,she is actively working on women empowerment initiatives.",
    "type": "Panel Discussion Speaker",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/psk-4.jpg",
    "title": "Dr. Chit Su Mon",
    "desc": "Assistant Professor & Programme Director,",
    "desc1": "School of Mathematical & Computer Sciences,Heriot-Watt University,Malaysia.",
    "type": "Panel Discussion Speaker",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/tan.jpg",
    "title": "Tan Lay Hong,",
    "desc": "Senior Lecturer,",
    "desc1": "Department of Technology Management,Universiti Teknikal Malaysia Melaka, Malaysia",
    "type": "Panel Discussion Speaker",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-1.jpg",
    "title": "Dr. Cheok Mui Yee",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-2.jpg",
    "title": "Dr. Jayanthy Periannan",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-3.jpg",
    "title": "Dr. Sameer Sawant",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-5.jpg",
    "title": "Dr. Sukumaran C",
    "desc": "Director of Physical Education",
    "desc1": "Government Law College, Madurai,Tamil Nadu, India.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/india.png"
  },
  {
    "img": "assets/img/sc-6.jpg",
    "title": "Dr.Fouzia Ajmal",
    "desc": "Assistant professor",
    "desc1": "IIUI, Pakistan.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/pakistan.png"
  },
  {
    "img": "assets/img/sc-7.jpg",
    "title": "Dr. Kamalesh Ravesangar",
    "desc": "Programme Leader & Assistant Professor",
    "desc1": "Tunku Abdul Rahman University of Management and Technology,Malaysia.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-8.png",
    "title": "Dr. Lee Fong Yee",
    "desc": "Assistant Professor",
    "desc1": "Faculty of Computing and Informatics,Multimedia University,Malaysia.",
    "type": "Workshop Speaker",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/tan.jpg",
    "title": "Tan Lay Hong,",
    "desc": "Senior Lecturer,",
    "desc1": "Department of Technology Management,Universiti Teknikal Malaysia Melaka, Malaysia",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-8.jpg",
    "title": "Patrick Duffy Bayuong",
    "desc": "Teacher",
    "desc1": "Belaga District Education Office,Ministry of Education Malaysia,Belaga, Sarawak, Malaysia",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-16.jpg",
    "title": "Dr. Mohammed Ibrahim Umer",
    "desc": "Assosa University Benishangul Gumuz region,",
    "desc1": "Assosa, Ethiopia.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/ethiopia.png"
  },
  {
    "img": "assets/img/sc-17.jpg",
    "title": "Sujatha Balakrishnan,",
    "desc": "Senior lecturer,Department of Management,Nilai University",
    "desc1": "Malaysia",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-18.jpg",
    "title": "Ms. Aliaa Diyana Zamri,",
    "desc": "SLecturer,",
    "desc1": "School of Business and Social Sciences,Albukhary International University,Malaysia",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-19.jpg",
    "title": "Dr. Ayu Haslija Abu Bakar,",
    "desc": "Assistant Professor,",
    "desc1": "Faculty of Engineering,Sunway University,Malaysia",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-20.jpg",
    "title": "Dr. Norhasyimi Rahmat,",
    "desc": "Senior Lecturer,",
    "desc1": "School of Chemical Engineering,Universiti Teknologi MARA,Malaysia.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-22.jpg",
    "title": "Ts. Dr. Ngu War Hlaing",
    "desc": "Lecturer at School of Engineering,",
    "desc1": "Faculty of Engineering and Technology,Sunway University Malaysia",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-23.jpg",
    "title": "Dr. MADHURIMADASGUPTA,",
    "desc": "HOD, DEPARTMENT OF GENDER STUDIES,",
    "desc1": "ASHADI WISDOM CAMPUS,Sri Lanka&Post-doctoral fellow,Abo-Akademi University,Finland",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/finland.png"
  },
  {
    "img": "assets/img/sc-24.jpg",
    "title": "Dr. Tan Fee Yean,",
    "desc": "Associate Professor,",
    "desc1": "Universiti Utara Malaysia,Malaysia.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-25.png",
    "title": "Dr. Goh Wei Wei,",
    "desc": "Associate Professor,",
    "desc1": "School of Computer Science,Taylor's University, Malaysia.",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/sc-26.jpg",
    "title": "Dr. Everly A. Nacalaban, LPT",
    "desc": "BSBA Program Chair",
    "desc1": "Bukidnon State University,Malitbog Campus Malitbog, Bukidnon, Philippines",
    "type": "Session Chairs",
    "flagUrl": "https://cdn.iferp.in/flag/philippines.png"
  },
  {
    "img": "assets/img/sc-21.jpg",
    "title": "Assoc Prof Ts Dr. Norbayah Mohd Suki",
    "desc": "Universiti Utara Malaysia",
    "desc1": "Malaysia.",
    "type": "Debate Speaker",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/mode1.jpg",
    "title": "Asst. Prof. Dr. Rana Altounjy",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia",
    "type": "Moderators",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },

  {
    "img": "assets/img/mode2.jpg",
    "title": "Asst. Prof. Dr. Dalwinder Kaur",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia",
    "type": "Moderators",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/mode3.jpg",
    "title": "Asst. Prof. Dr. Chok Nyen Vui",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia",
    "type": "Moderators",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/mode4.jpg",
    "title": "Dr. Jayanthy Periannan",
    "desc": "Manipal GlobalNxt University,",
    "desc1": "Malaysia",
    "type": "Moderators",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/mod-5.jpg",
    "title": "Ms. Gu Hairu",
    "desc": "Graduate School of Business",
    "desc1": "SEGi University & Colleges,Malaysia",
    "type": "Moderators",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/mod-6.jpg",
    "title": " Ms. Farhana Karim ",
    "desc": "Graduate School of Business",
    "desc1": "SEGi University & Colleges,Malaysia",
    "type": "Moderators",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/mod-7.jpg",
    "title": "Ms. Chao Ruiyun",
    "desc": "Graduate School of Business",
    "desc1": "SEGi University & Colleges,Malaysia",
    "type": "Moderators",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/mod-8.jpg",
    "title": " Ms. Xu Yang",
    "desc": "Graduate School of Business",
    "desc1": "SEGi University & Colleges,Malaysia",
    "type": "Moderators",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/rd-1.jpg",
    "title": "Pavitra Vasuthevan",
    "desc": "Nilai University",
    "desc1": "Malaysia",
    "type": "Registration Desk",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/rd-2.jpg",
    "title": "Haswyini Muthu",
    "desc": "Nilai University",
    "desc1": "Malaysia",
    "type": "Registration Desk",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  },
  {
    "img": "assets/img/rd-3.jpg",
    "title": "Khairunnisa Wardina Khairul Nidzam",
    "desc": "Nilai University",
    "desc1": "Malaysia",
    "type": "Registration Desk",
    "flagUrl": "https://cdn.iferp.in/flag/malaysia.png"
  }
]
