[
  {
    "paperTitle": "Unlocking Student Insights: The Role of Quillbot in Academic Writing",
    "authorName": "Nur Hidayati",
    "country": "Indonesia",
    "abstract": "AI tools have become widely used in the educational field, providing students with innovative approaches to improve their academic performance. This study examined the perceptions of post-graduate students majoring in English Education regarding the use of Quillbot in academic writing. The study employed a qualitative methodology within an interpretive paradigm. A total of 14 students participated in semi-structured interviews to gather in-depth insights into their experiences. The results showed that students frequently used Quillbot due to its efficiency and ability to paraphrase texts effectively. However, some students expressed concerns regarding the accuracy of Quillbot in preserving the original meaning and noting that some of the insights generated were not entirely suitable for academic writing. Furthermore, while some students believed that Quillbot contributed positively to their vocabulary mastery and comprehension of the material, others considered that using Quillbot reduced their active engagement and comprehensive understanding of the content. This duality of perception highlights the need for critical evaluation of AI tools in academic writing context. Ultimately, this research provides important insights into the role of AI tools, such as Quillbot, in academic writing practices, suggesting while it offers significant benefits, it also presents challenges that must be addressed to enhance writing outcomes effectively.",
    "imgUrl": "assets/img/ab-1.png",
    "keywords": "Artificial Intelligence, critical reading, junior high school students, systematic literature review, educational technology."
  },
  {
    "paperTitle": "Artificial Intelligence in Critical Reading Learning: A Systematic Literature Review of Junior Secondary Students",
    "authorName": "Dinda Amelia",
    "country": "Indonesia",
    "abstract": "This study aims to systematically review the application of Artificial Intelligence in improving critical reading skills among junior high school students. The rapid development of AI technologies has transformed educational practices, particularly in reading comprehension and analysis. By analyzing peer-reviewed articles from 2015 to 2023, this review highlights how AI tools such as intelligent tutoring systems, natural language processing, and adaptive learning platforms have been used to improve students' critical reading skills. To achieve the purpose of this article, a Systematic Literature Review (SLR) was conducted to find research conducted in undergraduate and graduate programs investigating the subject of AI applied to critical reading learning. The final analysis used a total of 20 studies consisting of 10 journals, 5 master theses, and 5 doctoral dissertations. The main results show that most of the research on AI in critical reading learning for junior high school students is conducted in the fields of computer science, engineering, and language. The findings suggest that AI-based approaches offer personalized learning experiences, immediate feedback, and interactive engagement, which significantly contribute to students' critical thinking and text analysis skills. However, there are still challenges in integrating AI effectively, such as limited access to technology, teacher training, and potential over-reliance on automated feedback. The review concludes by discussing implications for educators and policy makers, as well as providing suggestions for future research and practice in AI-driven critical reading instruction.",
    "imgUrl": "assets/img/ab-2.png",
    "keywords": ""
  },
  {
    "paperTitle": "A Re-Evaluation of the Understanding by Design (UbD) Framework in Writing Learning Modules",
    "authorName": "Leah Marie Tumlos-Castillo",
    "country": "Philippines",
    "abstract": "The heart of curriculum design is to give opportunities and provide support to students so they can achieve understanding and transfer of learning. This is made possible when teachers produce well-written learning modules. Back in 2015, an initial evaluation of the Understanding by Design (UbD) framework in writing learning modules was conducted. Results show that high school teachers of De La Salle Santiago Zobel (DLSZ) appreciate the concise and practical guidance of backward design in curriculum planning. In this reevaluation study, the question I desire to find answers to is: How is the UbD framework extensively used by Junior High School (JHS) teachers in writing learning modules? Primary research data were obtained by conducting an online survey using Google Forms among all JHS teachers and administrators (N=92) across 12 subject areas. There were 12 items in the survey questionnaire. Eleven (11) items pertained to the three (3) stages of the UbD framework, while one (1) item was concerned with how helpful the design framework is in systematically preparing the learning modules. Furthermore, an open-ended question was asked on the suggestions of teachers in making the learning modules more relevant and useful to them as users, and more effective in obtaining our instructional goals. Three (3) focus group discussions using Google Jamboard were held with nine (9) JHS educators to validate their perceptions in the use of the said framework. In addition, document analysis of 12 learning modules (6 core learning areas and 6 special subjects) was conducted to determine how evident the UbD framework is used by teachers based on its three (3) stages. This study employed a mixed-method approach where quantitative data were analyzed using descriptive statistics, while descriptive data were analyzed using thematic analysis.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": "Understanding by Design, backward design, curriculum design, learning module"
  },
  {
    "paperTitle": "E-Learning and Education for Sustainable Development in the Digital Age: A Bibliometric Analysis of Contributions to the SDGs",
    "authorName": "Muhammad Anarda Wiguna",
    "country": "Indonesia",
    "abstract": "The implementation of the Sustainable Development Goals (SDGs) by the United Nations in 2015 positioned education as a key element in achieving these global objectives, particularly SDG 4, which focuses on quality education. In the digital era, e-learning has emerged as a vital tool for expanding access to education across various regions. This study aims to analyze the contribution of e-learning research to Education for Sustainable Development (ESD) through a bibliometric approach. Utilizing the Scopus database, a total of 421 articles from 2010 to 2023 were analyzed to identify collaboration patterns, publication trends, and key topics that contribute to the SDGs. The findings reveal a significant increase in e-learning research focused on ESD since the introduction of the SDGs, with the largest surge occurring after the COVID-19 pandemic. The study also highlights that countries such as China, Spain, and the United States dominate academic contributions to this topic. Through this analysis, the study provides valuable insights into how e-learning can support SDG 4, while also contributing to other sustainability goals such as SDG 5 and SDG 13. These findings underscore the importance of e-learning in sustainable education and offer a roadmap for further development in this field.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": "",
    "indexitem": ""
  },
  {
    "paperTitle": "Analysis of the Role of Education for Sustainable Development (ESD) in Social, Science, and Environmental Education (2006-2024): Bibliometric Perspective",
    "authorName": "Tiara Swastika Putri",
    "designation": "Student",
    "country": "Indonesia",
    "abstract": "The purpose of this study is to determine the trend of education for sustainable development in social science, environmental, mathematics, and chemistry education from a literature review and bibliometric analysis. This paper is also equipped with an explanation of the definition of education for sustainable development (ESD). VOSviewer mapping is used to analyze bibliometric data. The Scopus site is used to obtain research data. The keywords \"education for sustainable development\", \"sustainable development\", and \"education\" are used by us as keyword data searches for this study. We searched for data from 2006 to 2024. The results of the study showed that research on ESD in education was found from 2006 to 2024. In addition, the results of the study also showed that from 2006 to 2013 research increased, but in 2014 it decreased and increased in 2020 and decreased again in 2021. The highest peak of research was in 2022 with 167 articles. This study shows how important bibliometric analysis is to obtain information about the phenomenon. This study is prospective in helping and being a reference for scientists and researchers in conducting and determining research topics, especially regarding ESD.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": ""
  },
  {
    "paperTitle": "IMPROVING WRITING SKILLS: INTEGRATING 'NEWS IN LEVELS' AND INSTAGRAM",
    "authorName": "Deni Yatri",
    "designation": "Student",
    "country": "Indonesia",
    "abstract": "In the 21st century, Instagram has emerged as one of the latest and most popular Social Networking Sites (SNS) that can be integrated with 'News in Levels' App to improve the writing skills of EFL learners. This research employs a literature review methodology to critically examine the collaboration between these two apps in the context of generating writing content through Instagram. The process involves utilizing vocabulary from the 'News in Levels' app, yielding two primary outcomes: 1) Retelling the News, and 2) Creating original content. This article assesses the efficacy of this collaborative approach, delving into how it can be effectively incorporated into the learning process. It emphasizes the advantages of such integration, identifies necessary tools, proposes alternative methods to engage students in writing activities, and outlines essential factors to consider during the implementation phase. The empirical findings of this research hold both theoretical and practical significance, offering valuable insights to students, educators, and future researchers. The integration of Instagram and the 'News in Levels' App as a collaborative tool holds the potential to revolutionize traditional language learning paradigms. By fostering language skills alongside digital literacy and global awareness, this collaboration presents a pioneering pathway to holistic language education. The study ultimately contributes to a nuanced understanding of integrating contemporary SNS platforms into educational contexts, enriching the pedagogical landscape for EFL learners worldwide. In prospect, this study urges ongoing educational-tech-social media evolution.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": ""
  },
  {
    "paperTitle": "Analysis of the Cognitive Domain of Climate Literacy in Science Teacher Pre-Service and Possible Improvements Using Rasch Analysis",
    "authorName": "Supriyadi",
    "designation": "Student",
    "country": "Indonesia",
    "abstract": "This study analyzes the cognitive domain of climate literacy among Science Teacher Pre-Service, utilizing Rasch analysis to evaluate their understanding of key environmental concepts and identify potential areas for improvement. The data, collected from 337 respondents, comprised Likert-scale responses to statements assessing knowledge of carbon cycles, greenhouse gases, ozone depletion, and data interpretation skills. Descriptive statistics revealed that respondents demonstrated a moderate to high understanding, with average scores ranging between 3.5 and 4.2 on a five-point scale. Rasch analysis highlighted variations in item difficulty and person abilities, indicating a need to address gaps in specific cognitive domains, particularly in analyzing and communicating climate data effectively. The Wright Map illustrated an alignment between person abilities and item difficulties but exposed some gaps where item coverage was insufficient for highly capable respondents. Fit statistics suggested that a few items may require revision to ensure they consistently measure the intended constructs. These findings emphasize the importance of targeted interventions, including instructional strategies and curriculum enhancements, to strengthen climate literacy in teacher education programs. The study underscores the utility of Rasch analysis in diagnosing and improving assessment instruments for sustainable education.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": ""
  },

  {
    "paperTitle": "ESD Community Development for Teachers and Students Through the 40-Day Challenge Program",
    "authorName": "Suhendar Suhendar",
    "country": "Indonesia",
    "abstract": "Global climate change and environmental degradation highlight the need for the implementation of Education for Sustainable Development (ESD) in schools. Gerakan ESD Indonesia initiated the 40-Day Challenge to build resilient ESD communities among teachers and students through concrete action projects that address the impacts of climate change. The program engages teachers and students in undertaking 40 days projects designed to foster student future-thinking skills and long-term sustainable action, with teachers as the main facilitators. This research aims to evaluate the strengths, weaknesses, challenges, and solutions faced during the implementation of the 40 Days Challenge. The program involved 737 students and 112 teachers from 32 districts across Indonesia, with a focus on creating strong ESD communities. Teachers receive training in future-oriented learning techniques, including forecasting, scenario planning, and backcasting, to equip them to guide students in identifying and planning long-term solutions to sustainability challenges. The research methods used include an in-depth analysis of the program's strengths and weaknesses, identifying obstacles faced, and providing recommendations for further development. The findings show that the 40-Day Challenge effectively fosters sustainable habits in students through practical activities such as the use of renewable energy, waste management, tree planting, and other activities in raising awareness of the importance of sustainability. Training for teachers increases their effectiveness as facilitators in guiding ESD projects, strengthening their skills in sustainable education. However, there are challenges, especially in remote schools with limited internet access and other resources, which hinder the delivery of digital-based programs. The duration of 40 days also causes difficulties in maintaining the commitment and consistency of participants. The study recommends follow-up actions, including local stakeholder engagement, infrastructure upgrades and technology support, and digital monitoring systems to streamline program evaluation and continuity. Overall, the 40 Days Challenge has proven to be effective in building strong ESD communities in Indonesian schools, with promising potential as a national model for sustainability education. The program is expected to equip the younger generation with important future-thinking skills and encourage active involvement in environmental sustainability efforts at the school and community levels.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": ""
  },
  {
    "paperTitle": "The Influence of Santi Artificial Intelligence Chatbots on Enhancing Student Creativity",
    "authorName": "Erna Widyasari",
    "designation": "Master of Educational Administration",
    "country": "Indonesia",
    "abstract": "This article discusses the influence of Santi (Sains Bestie) artificial intelligence chatbots on enhancing student creativity. Artificial intelligence chatbots are computer programs designed to mimic human conversations. Chatbots can automatically respond to user questions and commands using artificial intelligence technology. For students, chatbots can become personal tutors that answer questions any time and anywhere. This significantly aids students in deepening their understanding of the subject matter and fostering creativity. With its ability to access vast amounts of information, a chatbot can explain difficult concepts, provide example questions, or even help with assignments. This is very helpful for students in understanding the lesson material better and improving their creativity performance.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": "",
    "indexitem": "Artificial Intelligence, Chatbots, Santi, Student Creativity, Educational Technology"
  },
  {
    "paperTitle": "From Rhetoric to Reality: Assessing the Inclusion of Persons with Disabilities in Local Government of Bangladesh",
    "authorName": "Rowshon Ara Romke",
    "designation": "Assistant Professor",
    "country": "Bangladesh",
    "abstract": "The inclusion of persons with disabilities (PWDs), particularly Physically Challenged Persons, in the local governance structures of Bangladesh remains a significant challenge despite national and international commitments toward inclusivity. This exclusion is largely due to socio-cultural stigmas, insufficient legal frameworks, and the lack of awareness about disability rights among local authorities. In this backdrop, this study attempts to see how far the inclusion of Physically Challenged Persons is being implemented in the domain of local government. Accordingly, the prime objective has been set to assess the present scenario of Physically Challenged Persons’ inclusion in local government and to unveil the problems they encounter and the prospects therein for effective inclusion of PWDs. A mixed-method approach was applied, combining both qualitative and quantitative methods, consisting of a sample survey among 100 Physically Challenged Persons, 50 KIIs, and 1 FGD. The study brings to the surface that hardly PWDs have any space or opportunity for their inclusion or participation in any form in the affairs of local government. Their voices are never heard; therefore, government intervention in the form of policies, plans, projects, and programs is being called for full inclusion of PWDs in the local government.",
    "imgUrl": "assets/img/ab-3.png",
    "keywords": ""
  },
  {
    "paperTitle": "Dimensions of Investment Gullibility: Exploring the Ponzi Scheme Victims in Davao City",
    "authorName": "William T Sucuahi",
    "designation": "Associate Professor",
    "country": "Philippines",
    "abstract": "The Ponzi scheme that defrauded many persons has raised concerns. A recent scam that targeted thousands of people in the Davao Region made money by promising them a high return on investment. This study aims to identify the dimensions of investment gullibility among different generations in Davao City and develop a research framework demonstrating the extracted components' significance and structure. An Exploratory Factor Analysis (EFA) was used to investigate a data set of 250 respondents gathered through quota purposive sampling. The study found three dimensions of investment gullibility.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": "Ponzi scheme, prospect theory, regret aversion, quality education."
  },
  {
    "paperTitle": "Thriving in the Digital Era: Technology Adoption, Competencies, and Culture on Higher Education Personnel Performance",
    "authorName": "Marlie Joy Sigod",
    "designation": "Associate Professor",
    "country": "Philippines",
    "abstract": "In the digital era, non-teaching personnel in higher education institutions (HEIs) play a vital role in institutional effectiveness and advancing Sustainable Development Goals (SDGs), yet their performance remains underexplored. This study developed a structural model using Structural Equation Modeling (SEM) to examine the relationships between digital technology adoption, digital competencies, organizational culture, and their impact on non-teaching personnel performance in public Philippine HEIs in Bukidnon, Misamis Oriental, and Lanao del Norte. Data from 319 non-teaching personnel were collected through a 70-item survey assessing key performance indicators and predictors. Findings revealed that digital technology adoption indirectly enhanced performance by improving ease of use, although its direct effect was insignificant. Digital competencies and organizational culture emerged as critical drivers, with communication, collaboration, and innovation identified as the most impactful dimensions. Structural Model 3 was identified as the best-fit model, highlighting the collective influence of these factors on personnel performance. These findings contribute to SDG 4 by promoting digital literacy and professional development, SDG 8 through strategies for cultivating digitally proficient workforces, SDG 9 by emphasizing innovation and operational efficiency, and SDG 17 by fostering collaborative approaches to institutional improvement. The proposed SIGOD Framework, focusing on Skills in the Digital Era, Innovation in Culture, Growth in Professional Development, Optimization of Performance Metrics, and Data-Driven Decision-Making, provides actionable strategies to enhance performance. This study reaffirms the relevance of theoretical frameworks, including the Balanced Scorecard and Digital Competence Framework, in driving transformative institutional strategies and advancing global SDG commitments.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": "Digital Competencies, Organizational Culture, Optimized Workforce Performance, Structural Equation Modeling, Philippine Higher Education Personnel Performance"
  },
  {
    "paperTitle": "Unveiling Emotion Patterns Using Electrodermal Activity Amplitudes for Lightweight Emotion Recognition Models",
    "authorName": "Betsy Chacko",
    "designation": "Assistant Professor and Research Scholar",
    "country": "India",
    "abstract": "Emotion recognition through physiological signals has received significant attention in domains such as mental health, education, and human-computer interaction. Electrodermal activity (EDA), identified as a sensitive index of the sympathetic nervous system, is a widely preferred technique in analyzing emotional states. This paper presents an exploratory analysis of minimally preprocessed and non-decomposed electrodermal activity signal amplitudes. It examines the potential of exploring raw time series data from EDA for emotion classification with reduced computational effort. Analysis of electrodermal activity (EDA) data from the DEAP dataset, without prior signal decomposition, revealed that the average time series amplitude per emotion class exhibits characteristic trends and patterns. Results show that amplitude values within specific time ranges can enhance feature sets to identify and classify emotion according to the 2D valence-arousal space. The proposed method is advantageous for lightweight emotion classification models where real-time monitoring and biofeedback are critical. This work provides valuable insights into advanced emotion recognition, paving the way for innovative applications within affective computing and related fields.",
    "imgUrl": "assets/img/ab-4.png"
  },
  {
    "paperTitle": "Novel Use of Deep Learning for Adaptive Weighted Loss in the Segmentation of X-ray Images for Detecting Wrist Fractures",
    "authorName": "Sarjon Defit",
    "designation": "Professor",
    "country": "Indonesia",
    "abstract": "Image transmission technology has made significant contributions to various fields, especially medical imaging, which employs X-ray imaging to detect abnormalities in the human body, such as cracks and fractures. The image segmentation method is a computational approach that divides digital images into several segments with similar visual characteristics. This research proposes a novel image segmentation method for wrist fractures utilizing an adaptive weighted-loss approach. The objective is to enhance the precision of identifying wrist fractures on X-ray images, with the target being an accuracy of 71%, a precision of 78%, a recall of 85%, and an F1-score of 81%. This study addresses a significant gap in the literature by proposing an effective method for identifying wrist fractures, a task for which there has been a dearth of effective methods. The adaptive weighted-loss method with linear weights proposed in this study is expected to overcome the challenges posed by overfitting and correct class imbalance, thereby ensuring that the model is not overly dependent on a single loss function. This approach is anticipated to enhance the model's generalization capabilities on test data.",
    "imgUrl": "assets/img/dummy.jpg",
    "keywords": "",
    "indexitem": "Dice Loss and BCE Loss method, Adaptive Weighted Loss, Wrist Fractures."
  },
  {
    "paperTitle": "Real-Time Monitoring of Pond Water Quality Parameters with IoT to Determine Optimum Data Using Euclidean Distance Algorithm",
    "authorName": "Muhammad Dahria",
    "designation": "PhD Student",
    "country": "Indonesia",
    "abstract": "The objective of this research is to develop an Internet of Things (IoT) system capable of monitoring shrimp pond water quality in real-time, focusing on three main parameters: temperature, pH, and dissolved oxygen (DO). The system integrates hardware in the form of sensors and microcontrollers, as well as cloud-based software for data processing and visualization. The collected data underwent analysis using the Euclidean Distance and Weighted Euclidean Distance methods to calculate the distance between data points, followed by a filtering process to retain relevant data based on proximity. The findings demonstrate that the IoT system accurately measures water quality parameters and automatically transmits data to the cloud platform for further monitoring and analysis. The Weighted Euclidean Distance method provides more optimal results than the standard Euclidean Distance method, as it considers the weight of each parameter. This system is expected to provide an innovative solution to support more efficient, data-based, and sustainable shrimp pond management.",
    "keywords": "",
    "imgUrl": "assets/img/dummy.jpg",
    "indexitem": "Internet of Things, water quality, shrimp ponds, Euclidean distance, weighted Euclidean distance, real-time Monitoring."
  },
  {
    "paperTitle": "Enhanced Hydrophobicity of Sweet Potato Starch Bioplastic Reinforced with Activated Carbon",
    "authorName": "Josef Vill S Villanueva",
    "designation": "DEAN",
    "country": "Philippines",
    "abstract": "Sweet potato starch was employed to generate activated carbon-reinforced bioplastics in this study. Water absorption, solubility, and moisture analysis were used to investigate the hydrophobicity of sweet potato-based bioplastics. The samples were immersed in still distilled water for 24 hours to test water absorption. Water absorption was lowest in Sample B (7mL glycerin with 0.4g activated carbon) at 33.447% of weight gain and greatest in Sample F (11mL with 0g) at 41.578%. Water solubility was measured by stirring samples every hour for 24 hours. Sample B (7mL glycerin with 0.4g activated carbon) had the lowest water solubility with 11.434% weight loss, whereas Sample F (11mL with 0g) had the greatest with 12.571%. Sample moisture was measured with the Sartorius Moisture Analyzer. Sample G (11mL glycerin with 0.4g activated carbon) had the lowest moisture content at 18.72833%, whereas Sample F (11mL without activated carbon) had the highest at 22.391667%. The water absorption and solubility tests showed that activated carbon reinforcement increased bioplastic hydrophobicity.",
    "keywords": "",
    "imgUrl": "assets/img/ab-5.png",
    "indexitem": ""
  },
  {
    "paperTitle": "Economic Contributions and Employment Effects of Sari-Sari Stores in Dumaguete City",
    "authorName": "ILDEFE T. VILLANUEVA",
    "designation": "University Director of University Enterprise Development",
    "country": "Philippines",
    "abstract": "Sari-sari stores are vital micro-enterprises in Dumaguete City, significantly contributing to the local economy through income generation and employment. This study examines their economic impact, focusing on household income, job creation, and their role in supporting community commerce. It analyzes the demographic profiles of store owners and employees, identifies challenges in sustaining these businesses, and evaluates strategies to address such challenges. Additionally, the research explores the relationships between sari-sari store income and key factors, including the demographic characteristics of respondents, employee income, and operational challenges. By investigating these connections, the study offers insights into how sari-sari stores operate within Dumaguete’s informal economy and contribute to its overall resilience. The findings underscore the critical role of sari-sari stores in promoting economic development and fostering social cohesion. Despite facing challenges such as resource limitations, market competition, and restricted access to financing, store owners demonstrate innovative strategies to sustain their businesses. This study provides actionable recommendations for strengthening the sustainability of sari-sari stores, emphasizing their potential to drive inclusive economic growth. Policymakers, business owners, and community leaders are encouraged to support these micro-enterprises to enhance livelihood opportunities and contribute to Dumaguete City’s economic resilience.",
    "imgUrl": "assets/img/ab-6.png",
    "keywords": "",
    "indexitem": "Economic contribution, employment effects, local economy , Sari-sari stores"
  },
  {
    "paperTitle": "Effect of Activated Carbon on the Mechanical Properties of Sweet Potato Starch Bioplastic",
    "authorName": "JOSEF VILL S VILLANUEVA",
    "designation": "DEAN",
    "country": "Philippines",
    "abstract": "Plastic pollution caused by single-use plastics has been a growing concern for environmentalists. This study explored the properties of sweet potato bioplastic samples to address plastic waste, focusing on tensile strength. The researchers created bioplastic samples using a mixture of sweet potato starch, vinegar, glycerin, and water. Tensile testing of 24 sweet potato bioplastics revealed that samples containing 7 mL of glycerin consistently exhibited greater ultimate strengths compared to those with 11 mL of glycerin. Specifically, samples containing activated carbon and 7 mL of glycerin had the highest mean ultimate strength (0.567 MPa), whereas those with no activated carbon but 11 mL of glycerin had the lowest (0.1483 MPa). Additionally, the samples with activated carbon and 7 mL of glycerin demonstrated the highest modulus of elasticity (1.3332 MPa) and yield strength (0.3311 MPa). These findings suggest that sweet potato bioplastics, particularly those with activated carbon and 7 mL of glycerin, have the potential to be a strong and sustainable alternative to conventional plastics. The study underscores the importance of optimizing the composition of bioplastics to enhance their mechanical properties and promote environmental sustainability.",
    "imgUrl": "assets/img/ab-5.png",
    "keywords": "",
    "indexitem": ""
  },
  {
    "paperTitle": "Bilingualism, Auditory Stimulation, and Attention Swings in University Students",
    "authorName": "Yarlequé Chocas, Luis Alberto",
    "designation": "University Multidisciplinary",
    "country": "Peru",
    "abstract": "In Peru, Spanish is spoken alongside 48 native languages, and many speakers of these languages currently attend universities. Additionally, increased access to mobile phones and laptops has fostered the habit of studying while listening to music among students. In this context, this study was conducted to determine whether bilingual students experience more or fewer attention fluctuations than their monolingual counterparts and whether studying while listening to music affects them. This research employs a quantitative approach, utilizing an experimental laboratory method. The study involved two groups of university students—one bilingual and the other monolingual—from five universities in the departments of Junín and Huancavelica, who voluntarily participated in the experiment. Attention fluctuations were assessed using a digital tachistoscope during a focused attention task. The experiment was conducted under two conditions: with and without auditory stimulation. The results indicated, among other findings, that there are no statistical differences in intragroup comparisons (with and without auditory stimulation). However, differences emerge when comparing bilinguals to monolinguals. In conclusion, studying while listening to music does not affect students' attention, whether bilingual or monolingual. Nonetheless, being bilingual appears to present a disadvantage compared to monolinguals, at least concerning attention fluctuations.",
    "imgUrl": "assets/img/ab-7.png",
    "keywords": "",
    "indexitem": ""
  }
]
