[
  {
    "img": "assets/img/p-1.png",
    "icon": "assets/img/p-1.png",
    "title": "Presentation Opportunities",
    "desc": "ICMDRSE 2025 offers you the chance to present your research to a global audience, showcasing your work and gaining valuable feedback from scholars and professionals worldwide. This is an excellent opportunity to refine your ideas, receive constructive critiques, and expand your network"
  },
  {
    "img": "assets/img/p-1.png",
    "icon": "assets/img/p-1.png",
    "title": "Learning Opportunities",
    "desc": "Gain exposure to the latest trends, developments, and best practices in your field. Participate in keynote speeches, technical sessions, and workshops, and stay up-to-date with cutting-edge research and technological advancements."
  },
  {
    "img": "assets/img/p-1.png",
    "icon": "assets/img/p-1.png",
    "title": "Career Growth",
    "desc": "Interact with leading experts and representatives from top institutions. The conference provides valuable networking opportunities that could lead to new career prospects, collaborations, and job placements, boosting your professional trajectory."
  },
  {
    "img": "assets/img/p-1.png",
    "icon": "assets/img/p-1.png",
    "title": "Exposure to New Ideas",
    "desc": "ICMDRSE 2025 will ignite your creativity and inspire you to explore new areas in your research. You’ll be exposed to novel concepts, diverse perspectives, and innovative ideas that can enhance your academic and professional understanding."
  },
  {
    "img": "assets/img/p-1.png",
    "icon": "assets/img/p-1.png",
    "title": "Publication Opportunities",
    "desc": "Take advantage of opportunities to publish your research in prestigious journals like Scopus, WoS, and SCIE. This exposure will increase your visibility in the academic community, helping you build a stronger presence and influence in your field."
  },
  {
    "img": "assets/img/p-1.png",
    "icon": "assets/img/p-1.png",
    "title": "Lifetime Access to Research Presentations",
    "desc": "Enjoy lifetime access to all conference presentations through the IFERP Dashboard <br/>  This invaluable benefit allows you to revisit presentations, stay updated on the latest innovations, and use the materials as a long-term resource for reference and academic development."
  }
]
